{
  "en": {
    "langPt": "Português",
    "langEn": "English",
    "navHome": "Home",
    "navAbout": "About me",
    "navResume": "Resume",
    "greetings": "Greetings! I am",
    "homeName": "Iago Tito",
    "homeJobTitle": "Software Engineer, Backend Developer<br>Python, Go and learning Rust",
    "aboutTitle": "About me",
    "aboutText": "<p>I have a degree in Computer Science from the Federal University of Campina Grande and I'm currently looking for opportunities as a Software Engineer, Backend Developer, or anything related.</p><br><p>I enjoy programming and often have ideas for programs I could build. Even though all my ideas probably already exist, I still start them to learn something new, practice, or just have fun in the process. The hardest part is finishing any of these projects, but one day it will happen.</p><br><p>Facing problems, struggling a bit, and eventually figuring things out—that’s the part I enjoy the most. Sometimes it’s just a quick script; other times, it turns into a full weekend project. “Sleep with a problem, wake up with a solution,” as one of my teachers used to say. Automating repetitive tasks is something I often find myself doing, partly to make life easier, partly just for the fun of it. I also tend to lose track of time tweaking and customizing my environment until it feels just right. Sharing what I’ve learned and hearing how others do things is something I really value. I even made a YouTube video (in Portuguese) about <a href='https://youtu.be/7p4uzb-tiRQ'>Terminal Customization with ZSH</a>.</p><br><p>Outside my developer like, I am highly sensitive to light, so during the day you will always see me wearing some super effective glasses to protect against the excessive brightness of the sun.</p><br><p>I also enjoy games, RPG, and books in the science fiction and fantasy genres.</p>",
    "resumeTitle": "Resume",
    "resumeText": "More of my experiences",
    "resumeButtonText": "Download my CV",
    "resumeFilePath": "files/Resume_Iago_Tito.pdf",
    "resumeFileName": "Resume_Iago_Tito.pdf",
    "skillsTitle": "Skills",
    "skillsLanguagesFrameworksText": "Languages and Frameworks",
    "skillsLanguagesFrameworksSpans": [
      "Python",
      "Go",
      "Lua",
      "JavaScript",
      "HTML5",
      "CSS3",
      "Bash",
      "FastAPI",
      "SQLAlchemy",
      "PostgreSQL",
      "MongoDB"
    ],
    "skillsOtherText": "Other",
    "skillsOtherSpans": [
      "Git",
      "Docker",
      "Kubernetes",
      "AWS",
      "Azure",
      "Automation and Webscraping",
      "Shell script",
      "Linux",
      "Rest API",
      "Prometheus",
      "Datadog",
      "OpenTelemetry",
      "IaC",
      "FaaS",
      "Neovim"
    ],
    "footerText": "<p>This website was inspired by the <a href=\"https://bulmatemplates.github.io/bulma-templates/templates/personal.html\">template</a> and site created by <a href=\"https://mubaidr.js.org\">Muhammad Ubaid Raza</a>.</p>"
  },
  "pt": {
    "langPt": "Português",
    "langEn": "English",
    "navHome": "Início",
    "navAbout": "Sobre mim",
    "navResume": "Currículo",
    "greetings": "Saudações! Eu me chamo",
    "homeName": "Iago Tito",
    "homeJobTitle": "Desenvovedor de software, Backend (Python e Go)",
    "aboutTitle": "Sobre mim",
    "aboutText": "<p>Sou formado em Ciência da Computação pela Universidade Federal de Campina Grande e atualmente estou em busca de oportunidades como engenheiro de software, desenvolvedor backend ou algo nessa área.</p><p>Gosto de programar e frequentemente tenho ideias de projetos que poderia construir. Mesmo que muitas dessas ideias já existam, ainda assim gosto de começar para aprender algo novo, praticar ou simplesmente me divertir no processo. A parte mais difícil é finalizar esses projetos, mas um dia vai acontecer.</p><p>Encarar problemas, quebrar a cabeça e finalmente encontrar uma solução é a parte que mais gosto. Às vezes é só um script rápido; outras vezes, vira um projeto de fim de semana inteiro. “Durma com um problema, acorde com a solução”, como dizia um professor meu. Automatizar tarefas repetitivas é algo que faço com frequência, um pouco para facilitar a vida, outro tanto só pela diversão. Também costumo perder a noção do tempo personalizando meu ambiente até que tudo fique do meu jeito. Compartilhar o que aprendo e ouvir como outras pessoas fazem as coisas é algo que valorizo muito. Inclusive, fiz um vídeo no YouTube sobre <a href='https://youtu.be/7p4uzb-tiRQ'>Customização do terminal com ZSH</a>.</p><p>Fora da vida de desenvolvedor, sou muito sensível à luz, então, durante o dia, você sempre vai me ver usando óculos super eficientes pra me proteger do brilho excessivo do sol.</p><p>Também gosto de jogos, RPGs e livros dos gêneros ficção científica e fantasia.</p>",
    "resumeTitle": "Currículo",
    "resumeText": "Mais das minhas experiências",
    "resumeButtonText": "Baixe meu currículo",
    "resumeFilePath": "files/Curriculo_Iago_Tito.pdf",
    "resumeFileName": "Curriculo_Iago_Tito.pdf",
    "skillsTitle": "Habilidades",
    "skillsLanguagesFrameworksText": "Linguagens e Frameworks",
    "skillsLanguagesFrameworksSpans": [
      "Python",
      "Go",
      "Lua",
      "JavaScript",
      "HTML5",
      "CSS3",
      "Bash",
      "FastAPI",
      "SQLAlchemy",
      "PostgreSQL",
      "MongoDB"
    ],
    "skillsOtherText": "Outros",
    "skillsOtherSpans": [
      "Git",
      "Docker",
      "Kubernetes",
      "AWS",
      "Azure",
      "Automation and Webscraping",
      "Shell script",
      "Linux",
      "Rest API",
      "Prometheus",
      "Datadog",
      "OpenTelemetry",
      "IaC",
      "FaaS",
      "Neovim"
    ],
    "footerText": "<p>Este site foi inspirado no <a href=\"https://bulmatemplates.github.io/bulma-templates/templates/personal.html\">template</a> e site criados pelo <a href=\"https://mubaidr.js.org\">Muhammad Ubaid Raza</a>.</p>"
  }
}
